$(function(){
    // append()，向每个匹配的元素内部追加内容
    // $("p").append("<b>你好1</b>");

    // appendTo，将所有匹配的元素追加到特定的元素中。实际上，使用该方法是颠倒了常规的$(A).append(B)的操作，即不是将B追加到A中，而是将A追加到B中
    // $("<b>你好2</b>").appendTo("p");

    // prepend()，向每个匹配的元素内部前置内容
    // $("p").prepend("<b>你好3</b>");

    // prependTo()，将所有匹配的元素前置到置顶的元素中。实际上，使用该方法是颠倒了常规的$(A).prepend(B)的操作，即不是将B前置到A中，而是将A前置到B中
    // $("<b>你好4</b>").prependTo("p");

    // after()，在每个匹配的元素之后插入内容
    // $("p").after("<b>你好5</b>");

    // insertAfter(), 将所有匹配的元素插入到指定元素的后面。实际上，使用该方法是颠倒了常规的$(A).after(B)的操作，即不是将B插入到A后面，而是将A插入到B后面
    // $("<b>你好6</b>").insertAfter("p");

    // before()，在每个匹配的元素之前插入内容。
    // $("p").before("<b>你好7</b>");

    // insertBefore()，将所有匹配的元素插入到指定的元素的前面。实际上，使用该方法是颠倒了$(A).before(B)的操作，即不是将B插入到A前面，而是将A插入到B前面
    // $("<b>你好8</b>").insertBefore("p"); 
})